import Mock from 'mockjs'

Mock.mock('/prompt', {
    "code": 200,
    "message": "OK",
    "data": [
        "生命之灯因热情而点燃，生命之舟因拼搏而前行。",
        "成功是一种观念，成功是一种思想，成功是一种习惯，成功是一种心态。",
        "人生有如钓鱼，一竿在手，希望无穷。",
        "一个意志坚定，敢作敢为的人，永远信任自己。老天赋予任何人以能力，无非希望他能成为一个勇敢的人。",
        "如果心胸不似海，又怎能有海一样的事业。",
        "放弃该放弃的是无奈，放弃不该放弃的是无能，不放弃该放弃的是无知，不放弃不该放弃的是执着。",
        "任何的限制，都是从自己的内心开始的。",
        "习惯能够改变命运；改变自己，从点滴做起；改变一定会有痛苦，但成果是辉煌的；好的习惯会吸引成功。",
        "挫折其实就是迈向成功所应缴的学费。",
        "做决定之前仔细考虑，一旦作了决定就要勇往直前、坚持到底。",
        "不听指点，多绕弯弯。不懂装懂，永世饭桶。",
        "不问的人永远和愚昧在一起。",
        "成功决不喜欢会见懒汉，而是唤醒懒汉。",
        "思想改变行动，行动改变习惯，习惯改变性格，性格改变命运。",
        "外在压力增加时，就应增强内在的动力。",
        "欲望以提升热忱，毅力以磨平高山。",
        "人生舞台的大幕随时都可能拉开，关键是你愿意表演，还是选择躲避。",
        "让我们将事前的忧虑，换为事前的思考和计划吧！",
        "如果无法控制自己的情绪 就无法控制周围的情境。",
        "把你心中的烦恼 向多少人分担 你的烦恼就会除以多少。"
    ]
})